---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.IExportContext2D
source: html/163d8148-bf24-9bc2-3976-02ebf2388b1a.htm
---
# IExportContext2D Members

This method is called when a Curve is being output.